# !/usr/bin/env python3
# -*- coding: utf-8 -*-

if __name__ == '__main__':

    # Ввести свой ответ на пример.
    Answer = int(input("Решим пример 4*100-54="
                       "(напишите свой ответ)"))

    # Вывести правильный ответ.
    print("Правильный ответ", 4 * 100 - 54)

    # Вывести свой ответ.
    print("Ваш ответ", Answer)